tap "1password/tap"
tap "babashka/brew"
tap "borkdude/brew"
tap "candid82/brew"
tap "clojure-lsp/brew"
tap "d12frosted/emacs-plus"
tap "graalvm/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jdhollis/fenna"
tap "mike-engel/jwt-cli"
brew "libpng"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "coreutils"
brew "openssl@3"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "aspell"
brew "python@3.11"
brew "awscli"
brew "awslogs"
brew "blueutil"
brew "boost"
brew "pcre2"
brew "glib"
brew "openssl@1.1"
brew "pcre"
brew "python@3.9"
brew "cairo"
brew "clang-format"
brew "cloc"
brew "harfbuzz"
brew "rlwrap"
brew "clojure"
brew "cmake"
brew "cocoapods"
brew "colordiff"
brew "ctags"
brew "libssh2"
brew "openldap"
brew "curl"
brew "go"
brew "dep"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "folly"
brew "edencommon"
brew "wxwidgets"
brew "erlang"
brew "elixir"
brew "elm"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "entr"
brew "exercism"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "fortune"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gnupg", link: false
brew "gobject-introspection"
brew "gpgme"
brew "netpbm"
brew "gts"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grip"
brew "guile"
brew "ncurses"
brew "htop"
brew "hub"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "krb5"
brew "leiningen"
brew "libfido2"
brew "libpq"
brew "libssh"
brew "make"
brew "markdown"
brew "maven"
brew "mysql"
brew "nats-server"
brew "neovim"
brew "nghttp2"
brew "node"
brew "nvm"
brew "pinentry-mac"
brew "python@3.10"
brew "ponysay"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "python@2"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "switchaudio-osx"
brew "task"
brew "tcl-tk", link: false
brew "telnet"
brew "terraforming"
brew "tfenv"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "wireshark"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "babashka/brew/neil"
brew "borkdude/brew/clj-kondo"
brew "candid82/brew/joker"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp", "without-cocoa"]
brew "heroku/brew/heroku"
brew "jdhollis/fenna/fenna"
brew "mike-engel/jwt-cli/jwt-cli"
cask "1password-cli"
cask "adoptopenjdk"
cask "dash"
cask "docker"
cask "font-fira-code"
cask "github"
cask "gpg-suite"
cask "graalvm-ce-lts-java11"
cask "insomnia"
cask "keybase"
cask "kindle"
cask "licecap"
cask "omnifocus"
cask "reactotron"
cask "temurin"
cask "zoom"
cask "zoomus"
