# Taps
tap "candid82/brew"
tap "clojure-lsp/brew"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "mike-engel/jwt-cli"
tap "nats-io/nats-tools"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "arc"
cask "brave-browser"
cask "claude"
cask "homebrew/cask/dash"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "font-fira-code"
cask "github"
cask "gpg-suite"
cask "insomnia"
cask "iterm2"
cask "licecap"
cask "omnifocus"
cask "reactotron"
cask "signal"
cask "temurin"
cask "visual-studio-code"
cask "zoom"

# Formulae
brew "aider"
brew "asdf"
brew "aspell"
brew "awscli"
brew "awslogs"
brew "borkdude/brew/babashka"
brew "bat"
brew "black"
brew "blueutil"
brew "borkdude/brew/clj-kondo"
brew "candid82/brew/joker"
brew "clang-format"
brew "cloc"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "curl"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["without-cocoa"]
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "erlfmt"
brew "exercism"
brew "fd"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gomodifytags"
brew "gopls"
brew "gotests"
brew "graphviz"
brew "grip"
brew "gum"
brew "heroku/brew/heroku"
brew "highlight"
brew "htop"
brew "ical-buddy"
brew "imagemagick"
brew "isort"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "leiningen"
brew "markdown"
brew "maven"
brew "mike-engel/jwt-cli/jwt-cli"
brew "nats-io/nats-tools/nats"
brew "nats-server"
brew "neovim"
brew "pgformatter"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "ponysay"
brew "pytest"
brew "rebar3"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "stow"
brew "stylelint"
brew "swiftformat"
brew "switchaudio-osx"
brew "task"
brew "telnet"
brew "tfenv"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "wireshark"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
